{
	"common":[
		{
			"name":"id",
			"type":"string",
			"multiValued":false,
			"description":"Unique identifier for the SCIM resource as defined by the Service Provider. Each representation of the resource MUST include a non-empty id value. This identifier MUST be unique across the Service Provider's entire set of resources. It MUST be a stable, non-reassignable identifier that does not change when the same resource is returned in subsequent requests. The value of the id attribute is always issued by the Service Provider and MUST never be specified by the Service Consumer.",
			"readOnly":true,
			"required":true,
			"caseExact":false
		},
		{
			"name":"externalId",
			"type":"string",
			"multiValued":false,
			"description":"An identifier for the Resource as defined by the Service Consumer. The externalId may simplify identification of the Resource between Service Consumer and Service provider by allowing the Consumer to refer to the Resource with its own identifier, obviating the need to store a local mapping between the local identifier of the Resource and the identifier used by the Service Provider. The Service Provider MUST always interpret the externalId as scoped to the Service Consumer's tenant.",
			"readOnly":false,
			"required":false,
			"caseExact":false
		},
		{
			"name":"meta",
			"type":"complex",
			"multiValued":false,
			"description":"A complex attribute containing resource metadata. All sub-attributes are OPTIONAL",
			"readOnly":false,
			"required":false,
			"caseExact":false,
			"subAttributes":[
				{
					"name":"created",
					"type":"datetime",
					"multiValued":false,
					"description":"The DateTime the Resource was added to the Service Provider. The attribute MUST be a DateTime." ,
					"readOnly":true,
					"required":false,
					"caseExact":false
				},
				{
					"name":"lastModified",
					"type":"datetime",
					"multiValued":false,
					"description":"The most recent DateTime the details of this Resource were updated at the Service Provider. If this Resource has never been modified since its initial creation, the value MUST be the same as the value of created. The attribute MUST be a DateTime." ,
					"readOnly":true,
					"required":false,
					"caseExact":false
				},
				{
					"name":"location",
					"type":"string",
					"multiValued":false,
					"description":"The URI of the Resource being returned. This value MUST be the same as the Location HTTP response header." ,
					"readOnly":true,
					"required":false,
					"caseExact":false
				},
				{
					"name":"version",
					"type":"string",
					"multiValued":false,
					"description":"The version of the Resource being returned. This value must be the same as the ETag HTTP response header." ,
					"readOnly":true,
					"required":false,
					"caseExact":false
				},
				{
					"name":"attributes",
					"type":"string",
					"multiValued":true,
					"description":"The names of the attributes to remove from the Resource during a PATCH operation." ,
					"readOnly":false,
					"required":false,
					"caseExact":false
				}
			]
		}
	],
	"multi-valued":[
		{
			"name":"type",
			"type":"string",
			"multiValued":false,
			"description":"A label indicating the attribute's function; e.g., \"work\" or \"home\".",
			"readOnly":false,
			"required":false,
			"caseExact":false
		},
		{
			"name":"primary",
			"type":"boolean",
			"multiValued":false,
			"description":"A Boolean value indicating the 'primary' or preferred attribute value for this attribute, e.g. the preferred mailing address or primary e-mail address. The primary attribute value 'true' MUST appear no more than once.",
			"readOnly":false,
			"required":false,
			"caseExact":false
		},
		{
			"name":"display",
			"type":"string",
			"multiValued":false,
			"description":"A human readable name, primarily used for display purposes.",
			"readOnly":true,
			"required":false,
			"caseExact":false
		},
		{
			"name":"operation",
			"type":"string",
			"multiValued":false,
			"description":"The operation to perform on the multi-valued attribute during a PATCH request. The only valid value is \"delete\", which signifies that this instance should be removed from the Resource.",
			"readOnly":false,
			"required":false,
			"caseExact":false,
			"canonicalValues":["delete"]
		},
		{
			"name":"value",
			"type":"string",
			"multiValued":false,
			"description":"The attribute's significant value; e.g., the e-mail address, phone number, etc.",
			"readOnly":false,
			"required":true,
			"caseExact":false
		}
	]
}